# Options
cask_args appdir: "~/Applications", require_sha: true


### Taps ###

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "zero-sh/tap"


### CLI Tools ###

brew "git"                          # Version control system
brew "node"                         # Platform built on V8 to build network applications
brew "nvm"                          # Node Version Manager
brew "zero-sh/tap/zero"             # Simple tool to setup a new Mac
brew "zsh"                          # UNIX shell
brew "wget"                         # Internet file retriever
brew "curl"                         # CLI and library for transferring data with URLs
brew "mas"                          # Mac App Store CLI
brew "openssl"                      # Cryptography and SSL/TLS Toolkit
brew "aws-vault"                    # Securely store and access AWS credentials in development environments
brew "awscli"                       # Official Amazon AWS CLI
brew "gnutls"                       # GNU Transport Layer Security (TLS) Library
brew "gnupg"                        # GNU Pretty Good Privacy (PGP) package
brew "make"                         # 


### Apps ###

cask "bitwarden"                    # Password manager
cask "keybase"                      # Open source app for encryption, cryptography, and authentication.
cask "obsidian"                     # Note taking markdown editor
cask "spotify"                      # Music
cask "authy"                        # 2FA
cask "notion"                       # Note taking app
cask "tunnelblick"                  # OpenVPN client

## Browsers
cask "firefox"                      # Mozilla Firefox
cask "google-chrome"                # Google Chrome
cask "arc"                          # Arc Browser from The Browser Company

## MacOs Utilities
cask "alfred"                       # Productivity app for macOS
cask "spectacle"                    # Move and resize windows with ease
cask "bartender"                    # Menu bar icon organizer
cask "istat-menus"                  # Menu bar icon organizer

## Communication
cask "discord"                      # Chat app
cask "slack"                        # Chat app
cask "zoom"                         # Video conferencing
cask "microsoft-teams"              # Video conferencing
# cask "teamspeak-client"             # Voice chat

## Development
cask "jetbrains-toolbox"            # Manage all your JetBrains tools
brew "docker"                       # Build, Ship, and Run Any App, Anywhere
cask "tabby"                        # Terminal emulator
cask "figma"                        # Collaborative interface design tool
cask "insomnia"                     # REST Client
cask "nosql-workbench"              # GUI for DynamoDB, MongoDB, and more

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"               # Monospaced font with programming ligatures
cask "font-fira-code-nerd-font"     # Monospaced font with programming ligatures


### App Store Apps ###

mas "ColorSlurp", id: 1287239339    # Color picker
mas "iStat Menus", id: 1319778037   # System monitor
mas "Meeter", id: 1510445899        # Video conferencing reminder
mas "Pages", id: 409201541          # Word processor
