tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "surrealdb/tap"
tap "textualize/rich"
brew "awscli"
brew "cmake"
brew "docker", link: false
brew "git"
brew "guile"
brew "unbound"
brew "gnutls"
brew "gnupg", link: false
brew "go"
brew "jq"
brew "make"
brew "node"
brew "nvm"
brew "pinentry-mac"
brew "terraform-docs"
brew "wget"
brew "zsh"
brew "hashicorp/tap/terraform"
cask "alfred"
cask "bitwarden"
cask "figma"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "keybase"
cask "slack"
cask "spectacle"
cask "spotify"
cask "tabby"
cask "zoom"
cask "insomnia"
mas "ColorSlurp", id: 1287239339
mas "iStat Menus", id: 1319778037
mas "Meeter", id: 1510445899
mas "Pages", id: 409201541
